# Для решения была взята задача 3 из 2го урока:
# Сформировать из введенного числа обратное по порядку входящих в него цифр и вывести на экран.
# Например, если введено число 3486, надо вывести 6843.

# ЧТО БЫ НЕ ВВОДИТЬ ЧИСЛА ВРУЧНУЮ, ВО ВСЕХ ВАРИАНТАХ ЗАДАНИЯ ЗА ОСНОВУ
# БЫЛО ВЗЯТО ЧИСЛО 1234567890 (кроме task_1_ver_6, в этой версии число = 123456789)
# И ЧИСЛО 1234567890234646894326487758345234576484568567956, превосходящее первое в 3 раза по количеству знаков.

# Выводы: во всех вариантах решения прослеживается линейная зависимость времяни выполнения от количества замеров.
# В вариантах 1, 2, 3, 6 время выполнения не зависит от разницы количества знаков чисел 1234567890
# и 1234567890234646894326487758345234576484568567956.
# Однако в вариантах 4 и 5, время выполнения зависит и от количества замеров и от количества знаков.